wkndeng/netmf-interpreter/DeviceCode/Targets/Native/STM32L4/DeviceCode/STM32L4_ETH_lwip_OS/STM32L4_ETH_driver.cpp
/*
 * Copyright 2011 CSA Engineering AG
 *
 * Licensed under the Apache License, Version 2.0 (the "License");
 * you may not use this file except in compliance with the License.
 * You may obtain a copy of the License at
 *
 *     http://www.apache.org/licenses/LICENSE-2.0
 *
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an "AS IS" BASIS,
 * WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
 * See the License for the specific language governing permissions and
 * limitations under the License.
 */
 
/*********************************************************************************************
 * @file    STM32L4_ETH_driver.cpp
 * @brief   STM32L4 ethernet driver.
 * @author  CSA Engineering AG, Switzerland, www.csa.ch, info@csa.ch
 * @date    March 2012
 ********************************************************************************************/
  
//--------------------------------------------------------------------------------------------
// System and local includes
//--------------------------------------------------------------------------------------------
 
#include <tinyhal.h>


#include "STM32L4_ETH_driver.h"

//--------------------------------------------------------------------------------------------
// Local declarations
//--------------------------------------------------------------------------------------------

static void (*receiveIntHandler)();

//--------------------------------------------------------------------------------------------
// Local functions declarations
//--------------------------------------------------------------------------------------------

static void enableDmaInterrupts();
static void disableDmaInterrupts();
static void flushTxFifo();
static void initMACCR();
static void initMACFFR();
static void initMACMIIAR();
static void initMACFCR();
static void initMACIMR();
static void initDMABMR();
static void initDMAOMR();

//--------------------------------------------------------------------------------------------
// Functions definitions
//--------------------------------------------------------------------------------------------
/**
 * Initialize the DMA and MAC modules.
 * @return Error status.
 *   @retval TRUE if initialization successful.
 *   @retval FALSE otherwise.
 */
void eth_initDmaMacRegisters()
{
    // Init DMA and MAC registers
    initMACMIIAR();
    initMACCR();
    initMACFFR();
    initMACFCR();
    initDMAOMR();
    initDMABMR();
    initMACIMR();
}

//--------------------------------------------------------------------------------------------
/**
 * Initialize the 6-byte MAC address of the ethernet interface.
 * @param pAddress a pointer to the MAC address.
 */
void eth_initMacAddress(const uint8_t *const pAddress)
{
    // Initialize ETH_MACA0HR, the ethernet MAC address 0 high register
    ETH->MACA0HR &= ((uint32_t)pAddress[5] << 8U) |
                    ((uint32_t)pAddress[4]);
    
    // Initialize ETH_MACA0LR, the ethernet MAC address 0 low register
    ETH->MACA0LR =  ((uint32_t)pAddress[3] << 24U) |
                    ((uint32_t)pAddress[2] << 16U) |
                    ((uint32_t)pAddress[1] << 8U)  |
                    ((uint32_t)pAddress[0]);
 }

//--------------------------------------------------------------------------------------------
/**
 * Select the PHY interface.
 */ 
void eth_selectMii()
{
    // Select PHY interface
    RCC->AHB1RSTR |= RCC_AHB1RSTR_ETHMACRST;
    RCC->APB2ENR |= RCC_APB2ENR_SYSCFGEN;
#ifdef STM32L4_ETH_PHY_MII
    SYSCFG->PMC &= ~SYSCFG_PMC_MII_RMII;
#else
    SYSCFG->PMC |= SYSCFG_PMC_MII_RMII;
#endif
    RCC->AHB1RSTR &= ~RCC_AHB1RSTR_ETHMACRST;
}

//--------------------------------------------------------------------------------------------
/**
 * Enable the ethernet clocks.
 */ 
void eth_enableClocks()
{
    // Enable ethernet clocks
    RCC->AHB1ENR |= ( RCC_AHB1ENR_ETHMACRXEN
                    | RCC_AHB1ENR_ETHMACTXEN
                    | RCC_AHB1ENR_ETHMACEN
                    | RCC_AHB1ENR_ETHMACPTPEN
                    );
}

//--------------------------------------------------------------------------------------------
/**
 * Disable the ethernet clocks.
 */ 
void eth_disableClocks()
{
    // Disable ethernet clocks
    RCC->AHB1ENR &= ~( RCC_AHB1ENR_ETHMACRXEN
                     | RCC_AHB1ENR_ETHMACTXEN
                     | RCC_AHB1ENR_ETHMACEN
                     | RCC_AHB1ENR_ETHMACPTPEN
                     );
}

//--------------------------------------------------------------------------------------------
/**
 * Reset the MAC module. Wait until the reset operation completes or until a timeout elapses.
 * @return Error status.
 *   @retval TRUE if reset successful.
 *   @retval FALSE if timeout elapsed.
 */
BOOL eth_macReset()
{
    volatile uint32_t nWait = 0U;
    BOOL retval = TRUE;
    
    // Software reset
    ETH->DMABMR |= ETH_DMABMR_SR;
    
    // Wait for completion
    while ( ((ETH->DMABMR & ETH_DMABMR_SR) == ETH_DMABMR_SR) && 
            (nWait < MAC_RESET_TIMEOUT) )
    {
        nWait++;
    }
    
    // Check whether timeout elapsed
    if (nWait == MAC_RESET_TIMEOUT)
    {
        retval = FALSE;
    }
    
    return retval;
}

//--------------------------------------------------------------------------------------------
/**
 * Enable ethernet communication.
 */
void eth_enableTxRx()
{
    // Enable DMA interrupts
    enableDmaInterrupts();
    
    // Start DMA and MAC reception and transmission
    flushTxFifo();
    ETH->DMAOMR |= ETH_DMAOMR_SR | ETH_DMAOMR_ST;
    ETH->MACCR |= ETH_MACCR_RE | ETH_MACCR_TE;
}

//--------------------------------------------------------------------------------------------
/**
 * Disable ethernet communication.
 */
void eth_disableTxRx()
{
    // Stop MAC and DMA reception and transmission
    ETH->MACCR &= ~(ETH_MACCR_RE | ETH_MACCR_TE);
    ETH->DMAOMR &= ~(ETH_DMAOMR_SR | ETH_DMAOMR_ST);
    
