wkndeng/netmf-interpreter/DeviceCode/Targets/Native/STM32L4/DeviceCode/STM32L4_ETH_lwip_OS/STM32L4_ETH_driver.cpp
    // Disable DMA interrupts
    disableDmaInterrupts();
}
 
//--------------------------------------------------------------------------------------------
/**
 * Resume DMA transmission.
 */
void eth_resumeDmaTransmission()
{
    if ((ETH->DMASR & ETH_DMASR_TPS) == ETH_DMASR_TPS_Suspended)
    {
        // Resume DMA transmission
        ETH->DMATPDR = ETH_DMATPDR_TPD;
    }
}

//--------------------------------------------------------------------------------------------
/**
 * Resume DMA reception.
 */
void eth_resumeDmaReception()
{
    if ((ETH->DMASR & ETH_DMASR_RPS) == ETH_DMASR_RPS_Suspended)
    {
        // Resume DMA reception
        ETH->DMARPDR = ETH_DMARPDR_RPD;
    }
}

//--------------------------------------------------------------------------------------------
/**
 * Ethernet interrupt handler
 */
void eth_dmaInterruptHandler()
{
    #if defined (_DEBUG) && DEBUG_DMA_INT
    hal_printf("DMA Int:");
    #endif

    // Normal interrupt summary
    if ((ETH->DMASR & ETH_DMASR_NIS) == ETH_DMASR_NIS)
    {
        #if INT_ENABLE_RI
        if ((ETH->DMASR & ETH_DMASR_RS) == ETH_DMASR_RS)
        {
            // Ethernet frame received
            #if defined (_DEBUG) && DEBUG_DMA_INT
            hal_printf(" RS");
            #endif

            // Clear interrupt flag
            ETH->DMASR = ETH_DMASR_RS;

            // Process receive interrupt
            if (receiveIntHandler)
            {
                receiveIntHandler();
            }
        }
        #endif
        #if INT_ENABLE_TI
        if ((ETH->DMASR & ETH_DMASR_TS) == ETH_DMASR_TS)
        {
            // Ethernet frame sent
            #if defined (_DEBUG) && DEBUG_DMA_INT
            hal_printf(" TS");
            #endif

            // Clear interrupt flag
            ETH->DMASR = ETH_DMASR_TS;
        }
        #endif
        #if INT_ENABLE_TBUI
        if ((ETH->DMASR & ETH_DMASR_TBUS) == ETH_DMASR_TBUS)
        {
            // Transmit buffer unavailable
            #if defined (_DEBUG) && DEBUG_DMA_INT
            hal_printf(" TBUS");
            #endif

            // Clear interrupt flag, transmition is resumed after descriptors have been prepared
            ETH->DMASR = ETH_DMASR_TBUS;
        }
        #endif
        #if INT_ENABLE_ERI
        if ((ETH->DMASR & ETH_DMASR_ERS) == ETH_DMASR_ERS)
        {
            // Early receive
            #if defined (_DEBUG) && DEBUG_DMA_INT
            hal_printf(" ERS");
            #endif

            // Clear interrupt flag. Also cleared automatically by RI
            ETH->DMASR = ETH_DMASR_ERS;
        }
        #endif

        // Clear normal interrupt flag
        ETH->DMASR = ETH_DMASR_NIS;
    }

    // Abnormal interrupt summary
    if ((ETH->DMASR & ETH_DMASR_AIS) == ETH_DMASR_AIS)
    {
        #if INT_ENABLE_FBEI
        if ((ETH->DMASR & ETH_DMASR_FBES) == ETH_DMASR_FBES)
        {
            // Fatal bus error
            #if defined (_DEBUG) && DEBUG_DMA_INT
            hal_printf(" FBES");
            #endif

            // Clear interrupt flag
            ETH->DMASR = ETH_DMASR_FBES;
        }
        #endif
        #if INT_ENABLE_TPSI
        if ((ETH->DMASR & ETH_DMASR_TPSS) == ETH_DMASR_TPSS)
        {
            // Transmit process stopped
            #if defined (_DEBUG) && DEBUG_DMA_INT
            hal_printf(" TPSS");
            #endif

            // Clear interrupt flag
            ETH->DMASR = ETH_DMASR_TPSS;
        }
        #endif
        #if INT_ENABLE_TJTI
        if ((ETH->DMASR & ETH_DMASR_TJTS) == ETH_DMASR_TJTS)
        {
            // Transmit jabber timeout
            #if defined (_DEBUG) && DEBUG_DMA_INT
            hal_printf(" TJTS");
            #endif

            // Clear interrupt flag
            ETH->DMASR = ETH_DMASR_TJTS;
        }
        #endif
        #if INT_ENABLE_ROI
        if ((ETH->DMASR & ETH_DMASR_ROS) == ETH_DMASR_ROS)
        {
            // Receive overflow
            #if defined (_DEBUG) && DEBUG_DMA_INT
            hal_printf(" ROS");
            #endif

            // Clear interrupt flag
            ETH->DMASR = ETH_DMASR_ROS;
        }
        #endif
        #if INT_ENABLE_TUI
        if ((ETH->DMASR & ETH_DMASR_TUS) == ETH_DMASR_TUS)
        {
            // Transmit underflow
            #if defined (_DEBUG) && DEBUG_DMA_INT
            hal_printf(" TUS");
            #endif

            // Clear interrupt flag
            ETH->DMASR = ETH_DMASR_TUS;
        }
        #endif
        #if INT_ENABLE_RBUI
        if ((ETH->DMASR & ETH_DMASR_RBUS) == ETH_DMASR_RBUS)
        {
            // Receive buffer unavailable
            #if defined (_DEBUG) && DEBUG_DMA_INT
            hal_printf(" RBUS");
            #endif

            // Clear interrupt flag
            ETH->DMASR = ETH_DMASR_RBUS;
        }
        #endif
        #if INT_ENABLE_RPSI
        if ((ETH->DMASR & ETH_DMASR_RPSS) == ETH_DMASR_RPSS)
        {
            // Receive process stopped
            #if defined (_DEBUG) && DEBUG_DMA_INT
            hal_printf(" RPSS");
            #endif

            // Clear interrupt flag
            ETH->DMASR = ETH_DMASR_RPSS;
        }
        #endif
        #if INT_ENABLE_RWTI
        if ((ETH->DMASR & ETH_DMASR_RWTS) == ETH_DMASR_RWTS)
        {
            // Receive watchdog timeout
            #if defined (_DEBUG) && DEBUG_DMA_INT
            hal_printf(" RWTS");
            #endif

            // Clear interrupt flag
            ETH->DMASR = ETH_DMASR_RWTS;
        }
        #endif
        #if INT_ENABLE_ETI
        if ((ETH->DMASR & ETH_DMASR_ETS) == ETH_DMASR_ETS)
        {
            // Early transmit interrupt
            #if defined (_DEBUG) && DEBUG_DMA_INT
            hal_printf(" ETS");
            #endif

            // Clear interrupt flag
            ETH->DMASR = ETH_DMASR_ETS;
        }
        #endif

        // Clear abnormal interrupt flag
        ETH->DMASR = ETH_DMASR_AIS;
    }

    #if defined (_DEBUG) && DEBUG_DMA_INT
    hal_printf("\r\n");
    #endif
}

//--------------------------------------------------------------------------------------------
/**
 * Initialize receive descriptor list address register.
 * @param txAddress the address of the RX descriptor list.
 */
void eth_initTxDescList(uint32_t txAddress)
{
    ETH->DMATDLAR = txAddress;
}

//--------------------------------------------------------------------------------------------
/**
 * Initialize transmit descriptor list address register.
 * @param rxAddress the address of the RX descriptor list.
 */
void eth_initRxDescList(uint32_t rxAddress)
{
    ETH->DMARDLAR = rxAddress;
}

//--------------------------------------------------------------------------------------------
/**
 * Initialize the receive interrupt handler.
 */
void eth_initReceiveIntHandler(pIntHandler receiveHandler)
{
    receiveIntHandler = receiveHandler;
}

//--------------------------------------------------------------------------------------------
/**
 * Enable DMA interrupts.
 */
void enableDmaInterrupts()
{
    // Enable DMA interrupts
    #if INT_ENABLE_NIS
    ETH->DMAIER |= ETH_DMAIER_NISE;         // Normal interrupt summary
    #endif
    #if INT_ENABLE_AIS
    ETH->DMAIER |= ETH_DMAIER_AISE;         // Abnormal interrupt summary
    #endif
    #if INT_ENABLE_ERI
    ETH->DMAIER |= ETH_DMAIER_ERIE;         // Early receive
    #endif
    #if INT_ENABLE_FBEI
    ETH->DMAIER |= ETH_DMAIER_FBEIE;        // Fatal bus error
    #endif
    #if INT_ENABLE_ETI
    ETH->DMAIER |= ETH_DMAIER_ETIE;         // Early transmit interrupt
    #endif
    #if INT_ENABLE_RWTI
    ETH->DMAIER |= ETH_DMAIER_RWTIE;        // Receive watchdog timeout
    #endif
    #if INT_ENABLE_RPSI
    ETH->DMAIER |= ETH_DMAIER_RPSIE;        // Receive process stopped
    #endif
    #if INT_ENABLE_RBUI
    ETH->DMAIER |= ETH_DMAIER_RBUIE;        // Receive buffer unavailable
    #endif
    #if INT_ENABLE_RI
    ETH->DMAIER |= ETH_DMAIER_RIE;          // Received
    #endif
    #if INT_ENABLE_TUI
    ETH->DMAIER |= ETH_DMAIER_TUIE;         // Transmit underflow
    #endif
    #if INT_ENABLE_ROI
    ETH->DMAIER |= ETH_DMAIER_ROIE;         // Receive overflow
    #endif
    #if INT_ENABLE_TJTI
    ETH->DMAIER |= ETH_DMAIER_TJTIE;        // Transmit jabber timeout
    #endif
    #if INT_ENABLE_TBUI
    ETH->DMAIER |= ETH_DMAIER_TBUIE;        // Transmit buffer unavailable
    #endif
    #if INT_ENABLE_TPSI
    ETH->DMAIER |= ETH_DMAIER_TPSIE;        // Transmit process stopped
    #endif
    #if INT_ENABLE_TI
    ETH->DMAIER |= ETH_DMAIER_TIE;          // Transmit
    #endif
}

//--------------------------------------------------------------------------------------------
/**
 * Disable DMA interrupts.
 */
void disableDmaInterrupts()
{
    // Disable DMA interrupts
    #if INT_ENABLE_NIS
    ETH->DMAIER &= ~ETH_DMAIER_NISE;        // Normal interrupt summary
    #endif
    #if INT_ENABLE_AIS
    ETH->DMAIER &= ~ETH_DMAIER_AISE;        // Abnormal interrupt summary
    #endif
    #if INT_ENABLE_ERI
    ETH->DMAIER &= ~ETH_DMAIER_ERIE;        // Early receive
    #endif
    #if INT_ENABLE_FBEI
    ETH->DMAIER &= ~ETH_DMAIER_FBEIE;       // Fatal bus error
    #endif
    #if INT_ENABLE_ETI
    ETH->DMAIER &= ~ETH_DMAIER_ETIE;        // Early transmit interrupt
    #endif
    #if INT_ENABLE_RWTI
    ETH->DMAIER &= ~ETH_DMAIER_RWTIE;       // Receive watchdog timeout
    #endif
    #if INT_ENABLE_RPSI
    ETH->DMAIER &= ~ETH_DMAIER_RPSIE;       // Receive process stopped
    #endif
    #if INT_ENABLE_RBUI
    ETH->DMAIER &= ~ETH_DMAIER_RBUIE;       // Receive buffer unavailable
    #endif
    #if INT_ENABLE_RI
    ETH->DMAIER &= ~ETH_DMAIER_RIE;         // Received
    #endif
    #if INT_ENABLE_TUI
    ETH->DMAIER &= ~ETH_DMAIER_TUIE;        // Transmit underflow
    #endif
    #if INT_ENABLE_ROI
    ETH->DMAIER &= ~ETH_DMAIER_ROIE;        // Receive overflow
    #endif
    #if INT_ENABLE_TJTI
    ETH->DMAIER &= ~ETH_DMAIER_TJTIE;       // Transmit jabber timeout
    #endif
    #if INT_ENABLE_TBUI
    ETH->DMAIER &= ~ETH_DMAIER_TBUIE;       // Transmit buffer unavailable
    #endif
    #if INT_ENABLE_TPSI
    ETH->DMAIER &= ~ETH_DMAIER_TPSIE;       // Transmit process stopped
    #endif
    #if INT_ENABLE_TI
    ETH->DMAIER &= ~ETH_DMAIER_TIE;         // Transmit
    #endif
}

//--------------------------------------------------------------------------------------------
/**
 * Flush the data in the transmit FIFO. Wait until the reset operation completes or  
 * until a timeout elapses.
 */
static void flushTxFifo()
{
    volatile uint32_t nWait = 0U;
    
    // Flush Transmit FIFO
    ETH->DMAOMR |= ETH_DMAOMR_FTF;
    
    // Wait for completion
    while ( ((ETH->DMAOMR & ETH_DMAOMR_FTF) == ETH_DMAOMR_FTF) && 
            (nWait < FLUSH_TX_FIFO_TIMEOUT) )
    {
        nWait++;
    }
}

//--------------------------------------------------------------------------------------------
/**
 * Initialize ETH_MACCR, the ethernet MAC configuration register.
 */
static void initMACCR()
{
    ETH->MACCR &= ~ETH_MACCR_WD;                // Watchdog enabled
    ETH->MACCR &= ~ETH_MACCR_JD;                // Jabber enabled
    ETH->MACCR &= ~ETH_MACCR_IFG;               // Interframe gap:
    ETH->MACCR |=  ETH_MACCR_IFG_96Bit;         //   96 bit times
    ETH->MACCR &= ~ETH_MACCR_CSD;               // Carrier sense enabled
    
