wkndeng/netmf-interpreter/DeviceCode/Targets/Native/STM32L4/DeviceCode/STM32L4_ETH_lwip_OS/STM32L4_ETH_driver.cpp
    ETH->MACCR |=  ETH_MACCR_FES;               // 100 Mbit/s fast ethernet mode
    ETH->MACCR |=  ETH_MACCR_DM;                // Full-duplex mode

    ETH->MACCR &= ~ETH_MACCR_ROD;               // Receive own enabled
    ETH->MACCR &= ~ETH_MACCR_LM;                // Loopback mode disabled
    ETH->MACCR &= ~ETH_MACCR_IPCO;              // Checksum offload disabled
    ETH->MACCR |=  ETH_MACCR_RD;                // Retry disabled
    ETH->MACCR &= ~ETH_MACCR_APCS;              // Automatic pad/CRC stripping disabled
    ETH->MACCR &= ~ETH_MACCR_BL;                // Back-off limit:
    ETH->MACCR |=  ETH_MACCR_BL_10;             //   min(n, 10)
    ETH->MACCR &= ~ETH_MACCR_DC;                // Defferal check disabled
    ETH->MACCR &= ~ETH_MACCR_TE;                // Transmitter disabled
    ETH->MACCR &= ~ETH_MACCR_RE;                // Received disabled
}

//--------------------------------------------------------------------------------------------
/**
 * Initialize ETH_MACFFR, the ethernet MAC frame filter register.
 */
static void initMACFFR()
{
    ETH->MACFFR &= ~ETH_MACFFR_RA;              // Receive all disabled
    ETH->MACFFR &= ~ETH_MACFFR_HPF;             // Hash or perfect filter disabled
    ETH->MACFFR &= ~ETH_MACFFR_SAF;             // Source address filter disabled
    ETH->MACFFR &= ~ETH_MACFFR_SAIF;            // Source address inverse filtering disabled
    ETH->MACFFR &= ~ETH_MACFFR_PCF;             // Pass control frames:
    ETH->MACFFR |=  ETH_MACFFR_PCF_BlockAll;    //   prevents all control frames
    ETH->MACFFR &= ~ETH_MACFFR_BFD;             // Broadcast frames enabled
    ETH->MACFFR &= ~ETH_MACFFR_PAM;             // Pass all multicast disabled
    ETH->MACFFR &= ~ETH_MACFFR_DAIF;            // Destination address inverse filtering disabled
    ETH->MACFFR &= ~ETH_MACFFR_HM;              // Hash multicast disabled
    ETH->MACFFR &= ~ETH_MACFFR_HU;              // Hash unicast disabled
    ETH->MACFFR &= ~ETH_MACFFR_PM;              // Promiscuous mode disabled
}

//--------------------------------------------------------------------------------------------
/**
 * Initialize ETH_MACMIIAR, the ethernet MAC MII adress register.
 */
static void initMACMIIAR()
{ 
    // Clear the clock range
    ETH->MACMIIAR &= ~ETH_MACMIIAR_CR;
    
    // Select the clock range HCLK/62
    ETH->MACMIIAR |= ETH_MACMIIAR_CR_Div62;
}

//--------------------------------------------------------------------------------------------
/**
 * Initialize ETH_MACFCR, the ethernet MAC flow control register.
 */
static void initMACFCR()
{
    ETH->MACFCR &= ~ETH_MACFCR_PT;              // Pause time: 0
    ETH->MACFCR |=  ETH_MACFCR_ZQPD;            // Zero-quanta pause disabled
    ETH->MACFCR &= ~ETH_MACFCR_PLT;             // Pause low threshold:
    ETH->MACFCR |=  ETH_MACFCR_PLT_Minus4;      //   pause time minus 4 slot times
    ETH->MACFCR &= ~ETH_MACFCR_UPFD;            // Unicast pause frame detect disabled
    ETH->MACFCR &= ~ETH_MACFCR_RFCE;            // Receive flow control disabled
    ETH->MACFCR &= ~ETH_MACFCR_TFCE;            // Transmit flow control disabled
    ETH->MACFCR &= ~ETH_MACFCR_FCBBPA;          // Flow control busy/back pressure activate disabled
}

//--------------------------------------------------------------------------------------------
/**
 * Initialize ETH_MACIMR, the ethernet MAC interrupt mask register.
 */
static void initMACIMR()
{
    ETH->MACIMR |= ETH_MACIMR_TSTIM;            // Time stamp trigger interrupt disabled
    ETH->MACIMR |= ETH_MACIMR_PMTIM;            // PMT interrupt disabled
}
 
//--------------------------------------------------------------------------------------------
/**
 * Initialize ETH_DMABMR, the ethernet DMA bus mode register.
 */
static void initDMABMR()
{
    ETH->DMABMR |=  ETH_DMABMR_AAB;             // Address-aligned beat enabled
    ETH->DMABMR &= ~ETH_DMABMR_FPM;             // 4xPBL mode disabled
    ETH->DMABMR |=  ETH_DMABMR_USP;             // Use separeate PBL enabled
    ETH->DMABMR &= ~ETH_DMABMR_RDP;             // Rx DMA PBL:
    ETH->DMABMR |=  ETH_DMABMR_RDP_32Beat;      //   32
    ETH->DMABMR |=  ETH_DMABMR_FB;              // Fixed burst enabled
    ETH->DMABMR &= ~ETH_DMABMR_RTPR;            // Rx Tx priority ratio:
    ETH->DMABMR |=  ETH_DMABMR_RTPR_1_1;        //   1:1
    ETH->DMABMR &= ~ETH_DMABMR_PBL;             // Programmable burst length:
    ETH->DMABMR |=  ETH_DMABMR_PBL_32Beat;      //   32
    ETH->DMABMR &= ~ETH_DMABMR_EDE;             // Enhanced descriptor format disabled
    ETH->DMABMR &= ~ETH_DMABMR_DSL;             // Descriptor skip length: contiguous
    ETH->DMABMR &= ~ETH_DMABMR_DA;              // DMA Arbitration: round robin
}

//--------------------------------------------------------------------------------------------
/**
 * Initialize ETH_DMAOMR, the ethernet DMA operation mode register.
 */
static void initDMAOMR()
{
    ETH->DMAOMR &= ~ETH_DMAOMR_DTCEFD;          // Dropping of TCP/IP checksum error frames enabled
    ETH->DMAOMR |=  ETH_DMAOMR_RSF;             // Receive store and forwared enabled
    ETH->DMAOMR &= ~ETH_DMAOMR_DFRF;            // Flushing of received frames enabled
    ETH->DMAOMR &= ~ETH_DMAOMR_TSF;             // Transmit store and forwared disabled       
    ETH->DMAOMR &= ~ETH_DMAOMR_TTC;             // Transmit threshold control:
    ETH->DMAOMR |=  ETH_DMAOMR_TTC_16Bytes;     //   16
    ETH->DMAOMR &= ~ETH_DMAOMR_FEF;             // Forward error frames disabled
    ETH->DMAOMR &= ~ETH_DMAOMR_FUGF;            // Forward undersized good frames disabled
    ETH->DMAOMR &= ~ETH_DMAOMR_RTC;             // Receive threshold control:
    ETH->DMAOMR |=  ETH_DMAOMR_RTC_64Bytes;     //   no matter because RSF enabled
    ETH->DMAOMR &= ~ETH_DMAOMR_OSF;             // Operate on second frame disabled (otherwise 
                                                // frames might be sent twice since there is only 
                                                // one TX descriptor)
}

//--------------------------------------------------------------------------------------------
/**
 * Read a PHY register through MII.
 * @param phyAddress, the physical phy address of the PHY chip to be read
 * @param miiAddress the address of the register to read.
 * @param pMiiData a pointer to a variable where the read value is copied.
 * @return Error status.
 *   @retval TRUE if read successful.
 *   @retval FALSE otherwise (pMiiData is not modified).
 */
BOOL eth_readPhyRegister(uint32_t phyAddress, const uint32_t miiAddress, uint16_t *const pMiiData)
{
    uint32_t nWait = 0U; 
    uint32_t value = 0;
    
