wkndeng/netmf-interpreter/DeviceCode/Targets/Native/STM32L4/DeviceCode/STM32L4_ETH_lwip_OS/STM32L4_ETH_driver.cpp
    // Wait for PHY availability
    while ( ((ETH->MACMIIAR & ETH_MACMIIAR_MB) == ETH_MACMIIAR_MB) &&
            (nWait < MII_BUSY_TIMEOUT) )
    {
        nWait++;
    }

    if (nWait == MII_BUSY_TIMEOUT)
    {
        return FALSE;
    }
   
    value = ETH->MACMIIAR & ETH_MACMIIAR_CR; // Clear all bits except the clock rate
    ETH->MACMIIAR  = value
                   | (phyAddress << MACMIIAR_PA_POSITION)
                   | (miiAddress << MACMIIAR_MR_POSITION)
                   | ETH_MACMIIAR_MB;
   
    // Wait for completion
    for( nWait = 0; nWait < MII_BUSY_TIMEOUT; ++nWait )
    {
        if( !(ETH->MACMIIAR & ETH_MACMIIAR_MB) )
        {
            // Data Ready , Read data
            *pMiiData = ETH->MACMIIDR;
            return TRUE;
        }
    }
    
    return FALSE;

}

//--------------------------------------------------------------------------------------------
/**
 * Write to a PHY register through MII.
 * @param phyAddress, the physical phy address of the PHY chip to be write
 * @param miiAddress the address of the register to write.
 * @param miiData the value to write.
 * @return Error status.
 *   @retval TRUE if write successful.
 *   @retval FALSE otherwise.
 */
BOOL eth_writePhyRegister(uint32_t phyAddress, const uint32_t miiAddress, const uint16_t miiData)
{
    uint32_t nWait = 0U; 
    uint32_t value = 0U;

  
    // Wait for PHY availability
    while ( (ETH->MACMIIAR & ETH_MACMIIAR_MB) &&(nWait < MII_BUSY_TIMEOUT) )
    {
        nWait++;
    }

    if (nWait == MII_BUSY_TIMEOUT)
    {
        return FALSE;
    }
    // Write MII data first 
    ETH->MACMIIDR = miiData;

    value = ETH->MACMIIAR & ETH_MACMIIAR_CR;
    ETH->MACMIIAR  = value | (phyAddress << MACMIIAR_PA_POSITION) | (miiAddress << MACMIIAR_MR_POSITION) | ETH_MACMIIAR_MW | ETH_MACMIIAR_MB;


    while ( nWait < MII_BUSY_TIMEOUT ) 
    {
        if ( !(ETH->MACMIIAR & ETH_MACMIIAR_MB) )
        {
            return TRUE;
        }
        nWait++;
    }
    
    return FALSE;
}

//--------------------------------------------------------------------------------------------

